; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :action-costs :strips :typing)
  (:types
    phys_object location crate_type num container - object
    helicopter victim crate carrier - phys_object
    helicopter carrier - container
    )
  (:constants
    food_crate medicine_crate - crate_type
    depot - location


    n0 n1 n2 n3 n4 - num
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    (contains ?h - container ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    (nb_loaded_crates ?r - carrier ?n - num)

    (next ?numA - num ?numB - num)
    )

  (:functions
    (total-cost) - number
    (fly-cost ?from - location ?to - location) - number
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    (increase (total-cost) (fly-cost ?from ?to))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (contains ?h ?c)
    (not (at ?c ?l))
    (increase (total-cost) 10)
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (contains ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (contains ?h ?c))
    (has_crate ?v ?t)
    (increase (total-cost) 10)
    )
   )

  (:action load_crate_on_carrier
   :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
   :precondition
   (and
    (at ?h ?l)
    (at ?r ?l)
    (contains ?h ?c)
    (nb_loaded_crates ?r ?nb_loaded)
    (next ?nb_loaded ?new_nb_loaded)
    )
   :effect
   (and
     (not (nb_loaded_crates ?r ?nb_loaded))
     (nb_loaded_crates ?r ?new_nb_loaded)
     (not (contains ?h ?c))
     (contains ?r ?c)
     (increase (total-cost) 10)
     (empty ?h)
     )
   )

  (:action fly_carrier
    :parameters (?h - helicopter ?r - carrier ?from - location ?to - location)
    :precondition
    (and
      (empty ?h)
      (at ?h ?from)
      (at ?r ?from)
      )
    :effect
    (and
      (not (at ?h ?from)) (at ?h ?to)
      (not (at ?r ?from)) (at ?r ?to)
      (increase (total-cost) (fly-cost ?from ?to))
      )
    )

  (:action take_crate_from_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?r ?c)
      (empty ?h)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?new_nb_loaded ?nb_loaded)
      )
    :effect
    (and
      (not (contains ?r ?c))
      (not (empty ?h))
      (contains ?h ?c)
      (not (nb_loaded_crates ?r ?nb_loaded)) (nb_loaded_crates ?r ?new_nb_loaded)
      (increase (total-cost) 10)
      )
    )
  )

; problem
(define (problem helicopter_problem_4_1_3_10_10c7c3_5)
(:domain EMERGENCY_SERVICES_LOGISTICS)
(:objects
	helicopter1 - helicopter
	helicopter2 - helicopter
	helicopter3 - helicopter
	helicopter4 - helicopter
	loc1 - location
	loc2 - location
	loc3 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	food_crate - crate_type
	medicine_crate - crate_type
	person1 - victim
	person2 - victim
	person3 - victim
	person4 - victim
	person5 - victim
	person6 - victim
	person7 - victim
	person8 - victim
	person9 - victim
	person10 - victim
	carrier1 - carrier
)
(:init
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
	(= (total-cost) 0)
	(is_type crate1 food_crate)
	(at crate1 depot)
	(can_be_taken crate1)
	(is_type crate2 food_crate)
	(at crate2 depot)
	(can_be_taken crate2)
	(is_type crate3 food_crate)
	(at crate3 depot)
	(can_be_taken crate3)
	(is_type crate4 food_crate)
	(at crate4 depot)
	(can_be_taken crate4)
	(is_type crate5 food_crate)
	(at crate5 depot)
	(can_be_taken crate5)
	(is_type crate6 food_crate)
	(at crate6 depot)
	(can_be_taken crate6)
	(is_type crate7 food_crate)
	(at crate7 depot)
	(can_be_taken crate7)
	(is_type crate8 medicine_crate)
	(at crate8 depot)
	(can_be_taken crate8)
	(is_type crate9 medicine_crate)
	(at crate9 depot)
	(can_be_taken crate9)
	(is_type crate10 medicine_crate)
	(at crate10 depot)
	(can_be_taken crate10)
	(at helicopter1 depot)
	(empty helicopter1)
	(at helicopter2 depot)
	(empty helicopter2)
	(at helicopter3 depot)
	(empty helicopter3)
	(at helicopter4 depot)
	(empty helicopter4)
	(at person1 loc2)
	(at person2 loc2)
	(at person3 loc3)
	(at person4 depot)
	(at person5 loc1)
	(at person6 loc1)
	(at person7 loc2)
	(at person8 loc3)
	(at person9 loc2)
	(at person10 loc1)
	(at carrier1  depot)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 234)
	(= (fly-cost depot loc2) 156)
	(= (fly-cost depot loc3) 152)
	(= (fly-cost loc1 depot) 234)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 82)
	(= (fly-cost loc1 loc3) 123)
	(= (fly-cost loc2 depot) 156)
	(= (fly-cost loc2 loc1) 82)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 58)
	(= (fly-cost loc3 depot) 152)
	(= (fly-cost loc3 loc1) 123)
	(= (fly-cost loc3 loc2) 58)
	(= (fly-cost loc3 loc3) 1)
)
(:goal (and

	(at helicopter1 depot)

	(at helicopter2 depot)

	(at helicopter3 depot)

	(at helicopter4 depot)
	(has_crate person3 medicine_crate)
	(has_crate person6 food_crate)
	(has_crate person9 food_crate)
	(has_crate person9 medicine_crate)
	(has_crate person10 medicine_crate)
	))
(:metric minimize (total-cost))
)

; plan
1. (pick_up helicopter1 crate1 depot)
   deleted: (empty helicopter1) (can_be_taken crate1) (at crate1 depot)
   added: (contains helicopter1 crate1)
   goals met: 4 of 9
2. (move helicopter1 depot loc2)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc2)
   goals met: 3 of 9
3. (give helicopter1 crate1 person9 loc2 food_crate)
   deleted: (contains helicopter1 crate1)
   added: (empty helicopter1) (can_be_taken crate1) (has_crate person9 food_crate)
   goals met: 4 of 9
4. (move helicopter1 loc2 depot)
   deleted: (at helicopter1 loc2)
   added: (at helicopter1 depot)
   goals met: 5 of 9
5. (pick_up helicopter1 crate2 depot)
   deleted: (empty helicopter1) (can_be_taken crate2) (at crate2 depot)
   added: (contains helicopter1 crate2)
   goals met: 5 of 9
6. (move helicopter1 depot loc1)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc1)
   goals met: 4 of 9
7. (give helicopter1 crate2 person6 loc1 food_crate)
   deleted: (contains helicopter1 crate2)
   added: (empty helicopter1) (can_be_taken crate2) (has_crate person6 food_crate)
   goals met: 5 of 9
8. (move helicopter1 loc1 depot)
   deleted: (at helicopter1 loc1)
   added: (at helicopter1 depot)
   goals met: 6 of 9
9. (pick_up helicopter1 crate8 depot)
   deleted: (empty helicopter1) (can_be_taken crate8) (at crate8 depot)
   added: (contains helicopter1 crate8)
   goals met: 6 of 9
10. (move helicopter1 depot loc3)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc3)
   goals met: 5 of 9
11. (give helicopter1 crate8 person3 loc3 medicine_crate)
   deleted: (contains helicopter1 crate8)
   added: (empty helicopter1) (can_be_taken crate8) (has_crate person3 medicine_crate)
   goals met: 6 of 9
12. (pick_up helicopter2 crate9 depot)
   deleted: (empty helicopter2) (can_be_taken crate9) (at crate9 depot)
   added: (contains helicopter2 crate9)
   goals met: 6 of 9
13. (move helicopter2 depot loc2)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc2)
   goals met: 5 of 9
14. (give helicopter2 crate9 person9 loc2 medicine_crate)
   deleted: (contains helicopter2 crate9)
   added: (empty helicopter2) (can_be_taken crate9) (has_crate person9 medicine_crate)
   goals met: 6 of 9
15. (move helicopter2 loc2 depot)
   deleted: (at helicopter2 loc2)
   added: (at helicopter2 depot)
   goals met: 7 of 9
16. (pick_up helicopter2 crate10 depot)
   deleted: (empty helicopter2) (can_be_taken crate10) (at crate10 depot)
   added: (contains helicopter2 crate10)
   goals met: 7 of 9
17. (move helicopter2 depot loc1)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc1)
   goals met: 6 of 9
18. (give helicopter2 crate10 person10 loc1 medicine_crate)
   deleted: (contains helicopter2 crate10)
   added: (empty helicopter2) (can_be_taken crate10) (has_crate person10 medicine_crate)
   goals met: 7 of 9
19. (move helicopter2 loc1 depot)
   deleted: (at helicopter2 loc1)
   added: (at helicopter2 depot)
   goals met: 8 of 9
20. (move helicopter1 loc3 depot)
   deleted: (at helicopter1 loc3)
   added: (at helicopter1 depot)
   goals met: 9 of 9
